Revit 2027 API
RebarHandlePositionData.GetNumberOfBars Method
 Gets the number of bars currently in the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfBars()
Public Function GetNumberOfBars As Integer
public:
int GetNumberOfBars()
member GetNumberOfBars : unit -> int
Return Value
Int32
 Returns the number of bars currently in the rebar.
See Also
Reference
RebarHandlePositionData Class
Autodesk.Revit.DB.Structure Namespace